#pragma once

#include "resource.h"
#include "./include/FakeDDK.h"

#define IDS_PROCEXPOLER		L"Process Explorer"


#define WM_TREEVIEW_SORT	0x7E8
#define WM_NOTIFY_TRAYICON	0x7E9
#define WM_MSG_7EA			0x7EA
#define WM_MSG_7EB			0x7EB
#define WM_MSG_7EC			0x7EC
#define WM_MSG_7ED			0x7ED
#define WM_MSG_7EE			0x7EE
#define WM_MSG_7EF			0x7EF
#define WM_MSG_7F0			0x7F0
#define WM_MSG_7F1			0x7F1
#define WM_MSG_7F2			0x7F2
#define WM_MSG_7F3			0x7F3
#define WM_MSG_7F4			0x7F4
#define WM_MSG_7F5			0x7F5
#define WM_MSG_7F6			0x7F6
#define WM_MSG_7F7			0x7F7
#define WM_MSG_7F8			0x7F8
#define WM_MSG_7F9			0x7F9

///#define WM_PE_MSG1	0x7F2


enum WindowPlacementType
{
	Windowplacement,		///
	FindWindowplacement = 1,

	PropWindowplacement = 2,
	DllPropWindowplacement = 3,
	SysinfoWindowplacement = 4,
	StackWindowPlacement,
};

enum WindowType
{
	WINDOW_NONE,
	WINDOW_NORMAL,
	WINDOW_FRAME,
	WINDOW_DIALOG,
	WINDOW_MDICHILD,
};

//输出风格
enum TRACEFLAGS
{
	TRACE_MSG = 1,
	TRACE_ALV = 2,
	TRACE_WARNING = 4,
	TRACE_ERROR = 8,
	TRACE_OUT = 0x10,
	TRACE_IN = 0x20,
	TRACE_DUMP = 0x40,
	TRACE_FATAL = 0x80,

	///	这似乎是WINSTA.DLL内部所使用
	TRACE_TSAPI_OUT = 0x100,
	TRACE_TSAPI_IN = 0x200,
	TRACE_TSRPC_OUT = 0x400,
	TRACE_TSRPC_IN = 0x800,
	TRACE_BVT = 0x1000,
	TRACE_PERF = 0x2000,
};

enum EOsType
{
	WINDOWS_VISTA = 0x1,
	WINDOWS_7 = 0x2,
	WINDOWS_8 = 0x3,
	WINDOWS_10 = 0x4,
};

//////////////////////////////////////////////////////////////////////////
///定义工具条内的图标索引
///
enum EBmpIndex
{
	BMP_STAR,
	BMP_VIEW_DLLS,
	BMP_SEARCH,
	BMP_SAVE,
	BMP_VIEW_HANDLES,
	BMP_KILL_PROCESS,
	BMP_PROPERTIES,
	BMP_REFRESH,
	BMP_SHOW_PROCESS_TREE,
	BMP_SHOW_LOWER_PANE,
	BMP_HIDE_LOWER_PANE,
	BMP_STOP_SEARCH,
	BMP_FIND_PROCESS_BY_WINDOW,
	BMP_VIEW_SYSTEM_INFORMATION,
};


#define __ERROR__	GetLastError()
#define __TID__		GetCurrentThreadId()
#define __PID__		GetCurrentProcessId()
#define __THREAD__	GetCurrentThread()
#define __PROCESS__	GetCurrentProcess()

#define LoadArrowCursor()		LoadCursor(NULL,IDC_ARROW)
#define LoadAppStringCursor()	LoadCursor(NULL,IDC_APPSTARTING)
#define LoadWaitCursor()		LoadCursor(NULL,IDC_WAIT)
#define LoadHandCursor()		LoadCursor(NULL,IDC_HAND)

#define SetArrowCursor()		SetCursor(LoadCursor(NULL,IDC_ARROW))
#define SetAppStringCursor()	SetCursor(LoadCursor(NULL,IDC_APPSTARTING))
#define SetWaitCursor()			SetCursor(LoadCursor(NULL,IDC_WAIT))
#define SetHandCursor()			SetCursor(LoadCursor(NULL,IDC_HAND))

#define ErrorMsgBox(hWnd,lpszText)					MessageBoxW(hWnd,lpszText,L"Process Explorer Error",MB_ICONERROR)

#define Tooltips_SetDelayTime(hWnd, Flags, Time)	SendMessage((hWnd),TTM_SETDELAYTIME, (Flags), (Time))
#define Tooltips_SetMaxWidth(hWnd,nWidth)			SendMessage((hWnd),TTM_SETMAXTIPWIDTH, 0, (nWidth))

#define DEFINEPATHTEXT(Name)						WCHAR sz##Name[_MAX_PATH] ={ 0 }

#define EXTERN_DEFINE(Name)							extern LPFN_##Name  gpfn_##Name;
#define INIT_LOAD(Name)								LPFN_##Name		gpfn_##Name = (LPFN_##Name)GetProcAddress(GetModuleHandleW(L"NTDLL.DLL"),#Name);
#define INIT_DEFINE(Name)							LPFN_##Name		gpfn_##Name = NULL;
#define INIT_LOADAPI(hModule,Name)					LPFN_##Name		gpfn_##Name = (LPFN_##Name)GetProcAddress(hModule,#Name);

#define LOADKERNELAPI(Name)							LPFN_##Name		pfn_##Name = (LPFN_##Name)GetProcAddress(GetModuleHanleW(L"Kernel32.dll"),#Name)
#define LOADKERNELBASEAPI(Name)						LPFN_##Name		pfn_##Name = (LPFN_##Name)GetProcAddress(GetModuleHanleW(L"KernelBase.dll"),#Name)



#define C_PAGES		4
#define sz_Or_Ord	WORD
#define titleLen	30
#define stringLen	30


//0x64=100
typedef struct
{
	WORD      dlgVer;			//0
	WORD      signature;		//0x02
	DWORD     helpID;			//0x04
	DWORD     exStyle;			//0x08
	DWORD     style;			//0x0C
	WORD      cDlgItems;		//0x0E
	short     x;				//0x10
	short     y;				//0x12
	short     cx;				//0x14
	short     cy;				//0x16
	sz_Or_Ord menu;				//0x18
	sz_Or_Ord windowClass;		//0x20
	WCHAR     title[titleLen];	//0x22
	WORD      pointsize;		//0x40	
	WORD      weight;			//0x42
	BYTE      italic;			//0x44
	BYTE      charset;			//0x45
	WCHAR     typeface[stringLen];//0x46
}DLGTEMPLATEEX;


typedef struct {
	DWORD     helpID;
	DWORD     exStyle;
	DWORD     style;
	short     x;
	short     y;
	short     cx;
	short     cy;
	DWORD     id;
	sz_Or_Ord windowClass;
	sz_Or_Ord title;
	WORD      extraCount;
} DLGITEMTEMPLATEEX;

#define MAX_TEMPLATE_NAME_LEN	256
#define MAX_PROPITEM_COUNT		32

//////////////////////////////////////////////////////////////////////////
///PE主菜单对应的各项
enum EMainMenuIndex
{
	MAINMENU_File,		///文件菜单
	MAINMENU_Options,	///Options菜单
	MAINMENU_View,		///View菜单
	MAINMENU_Process,	///Process菜单
	MAINMENU_Find,		///Find菜单
	MAINMENU_Help,		///Help菜单
};

#define GetFileMenu(hWnd)		GetSubMenu(GetMenu(hWnd),MAINMENU_File)
#define GetOptionsMenu(hWnd)	GetSubMenu(GetMenu(hWnd),MAINMENU_Options)
#define GetViewMenu(hWnd)		GetSubMenu(GetMenu(hWnd),MAINMENU_View)
#define GetProcessMenu(hWnd)	GetSubMenu(GetMenu(hWnd),MAINMENU_Process)
